{
    "album": "The Candidates",
    "trackNumber": 10,
    "title": "Don’t Be Shy",
    "feature": null,
    "version": null,
    "length": "3:51",
    "bio": "Released November 18, 2024, “Don’t Be Shy” is one of QueenServeantDonked’s most explicit and provocative tracks. Produced by periyuh, it showcases the duo’s irreverent lyrical style and playful approach to pop rap.",
    "lyrics": [
        "Don't be shy and fuck me harder",
        "I won't bleed, I won't bleed",
        "There won't be any blood coming out my ass",
        "The only thing coming out my ass is your cum, Yuh",
        "",
        "My flow spit crack like Nicki Minaj",
        "Come over daddy, let me show you how to do the manaj",
        "Get in my bed, I'mma rummage in your asshole",
        "Then I'ma get you on your back and stick your dick in my ass",
        "Then I'ma bounce on it like there is",
        "No motherfucking tomorrow, daddy Yuh",
        "",
        "Don't be shy and fuck me harder",
        "I won't bleed, I won't bleed",
        "There won't be any blood coming out my ass",
        "The only thing coming out my ass is your cum, Yuh",
        "",
        "I'm here to study your balls",
        "So don't be shy and come off, take off your drawls",
        "I don't bite, the only thing that I'll do",
        "Is wipe the cum off of your pink tip",
        "Don't be shy",
        "",
        "Yeah, I really like to play with my pussy",
        "And I'm so tired of everybody tryna judge me",
        "You bitches just be hating that you don't got this tight vagina",
        "You just mad that your man want my clit, yuh",
        "Suck on my pussy, bitch (Period)",
        "Lick on my clitoral hoodie, bitch (Period)",
        "I know you mad, I know you jealous, bitch (Period)",
        "I know you want to suck on all of this (Period)",
        "",
        "Don't be shy and fuck me harder Yuh, hehe",
        "I won't bleed, I won't bleed",
        "There won't be any blood coming out my ass",
        "The only thing coming out my ass is your cum, Yuh",
        "",
        "Gag you bitches so hard that you turn bulimic",
        "While I'm busy in the backseat playing with your dad's dick",
        "All this gagging that you do, you're just binge eating",
        "While I'm living my best life creaming and screaming",
        "Write about you on this track, made my phone feel heavier",
        "And I could smell the lack of clean vagina",
        "How you whiter than a ghost, but your skin so dirty?",
        "Just take a full shower, why you in a hurry?",
        "I write like a poet, tortured by your stench",
        "Take a seat, babe, just try not to break the bench",
        "Talented with my pen when I write raps",
        "And all you can do is eat spicy chicken wraps",
        "You sit in the mirror for hours at a time",
        "Trying to fix your lip liner to look prettier",
        "But you have no talent",
        "Just like your father likes them, now he's serving timer",
        "",
        "I'm getting money and I know how to dress",
        "You're getting money because you undress",
        "Claim that you hate me but talk, you're obsessed",
        "This is fan behaviour at its very best",
        "Got something to say, say it with your chest",
        "I go above and beyond, I don't even rest",
        "You do the bare minimum because that's your best",
        "Bitches wanna fight me but I'm the one they fear",
        "You a biggie but you no smallz, bitch",
        "So don't try to come over with that weak disk",
        "How you tryna copy me when you got that strong lisp?",
        "We only met cuz I'm looking at your dad's pit",
        "While you work that nine-to-five and can't make a five dollar tip",
        "My bussy tastes like mint, and yours tastes like shit",
        "So don't you ever think you got me with that shit",
        "Period",
        "",
        "Don't be shy and fuck me harder",
        "I won't bleed, I won't bleed",
        "There won't be any blood coming out my ass",
        "The only thing coming out my ass is your cum, Yuh",
        "",
        "Don't be shy and fuck me harder"
    ],
    "coverArt": null,
    "links": {}
}
