{
    "album": "SISSYPUSS",
    "trackNumber": 1,
    "title": "SISSYPUSS",
    "feature": "Kenna Fannee",
    "version": null,
    "length": "2:10",
    "bio": "SISSYPUSS is a provocative anthem by QueenServeantDonked and Kenna Fannee, embracing bold self-expression and unapologetic confidence. The track plays with themes of empowerment and desire, combining catchy lyrics and sensual undertones to create an unforgettable celebration of identity and freedom. Through playful verses and a catchy hook, Kenna Fannee delivers a cheeky, bold statement on being unapologetically oneself.",
    "lyrics": [
      "Purr",
      "I'm a sissypuss",
      "Just a sissypuss",
      "I'm a sissypuss",
      "Sissypuss",
      "I-I'm a sissypuss (Retarded)",
      "Just a sissypuss (Retarded)",
      "I'm a sissypuss (Retarded)",
      "Sissypuss",
      "Sissypussing down the street, on my way to collect meat",
      "You better know that I'm famous in this town",
      "Boys make it meow all around",
      "Not lesbi 'cause I love D, it's the only thing I love to see",
      "Catch me in a dark alleyway at 3 AM doing foreplay",
      "You wish you were me, I am one with the gaping loose pussy",
      "Will never be me because I am thee serving big pussy",
      "You wish you were me (You wish you were me)",
      "I am one with the (I am one with the) gaping loose pussy",
      "Will never be me (You'll never be me)",
      "Because I am thee (Because I am thee) serving big pussy",
      "I'm a sissypuss",
      "Just a sissypuss",
      "I'm a sissypuss",
      "Sissypuss",
      "I-I'm a sissypuss (Retarded)",
      "Just a sissypuss (Retarded)",
      "I'm a sissypuss (Retarded)",
      "Sissypuss",
      "Pussy is on fire (Pussy is on fire)",
      "Vocals strong as Beyoncé",
      "So come and touch the flames (Come and touch the flames)",
      "But don't play any games, yeah",
      "Take a big dip into my waters",
      "Kenna got sons and Kenna got daughters",
      "Everybody wants a piece of this",
      "Might let you hit if you call me \"Miss\"",
      "Thirsty for that drink into your system",
      "Golden showered and then dismissed him",
      "If you really want a piece of this, Kenna let you hit if you call her \"Miss\"",
      "I'm a sissypuss",
      "Just a sissypuss",
      "I'm a sissypuss",
      "Sissypuss",
      "I'm-I'm sis-sis-puss",
      "Just-just sis-sis-pu-pu-pu-puss",
      "Sissy-sissypuss"
    ],
    "coverArt": "https://t2.genius.com/unsafe/548x0/https%3A%2F%2Fimages.genius.com%2F82eeef7d539938b3d47ca7b725767c2f.1000x1000x1.png"
  }
  